> ./pam_authd login socket=${AUTHD_TESTS_CLI_AUTHENTICATE_TESTS_SOCK} force_native_client=true
Username:






























────────────────────────────────────────────────────────────────────────────────
> ./pam_authd login socket=${AUTHD_TESTS_CLI_AUTHENTICATE_TESTS_SOCK} force_native_client=true
Username: user-local-groups






























────────────────────────────────────────────────────────────────────────────────
> ./pam_authd login socket=${AUTHD_TESTS_CLI_AUTHENTICATE_TESTS_SOCK} force_native_client=true
Username: user-local-groups
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker:


























────────────────────────────────────────────────────────────────────────────────
> ./pam_authd login socket=${AUTHD_TESTS_CLI_AUTHENTICATE_TESTS_SOCK} force_native_client=true
Username: user-local-groups
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker: 2
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker:






















────────────────────────────────────────────────────────────────────────────────
> ./pam_authd login socket=${AUTHD_TESTS_CLI_AUTHENTICATE_TESTS_SOCK} force_native_client=true
Username: user-local-groups
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker: 2
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker: goodpass
Provided input can't be parsed as integer value
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker:

















────────────────────────────────────────────────────────────────────────────────
> ./pam_authd login socket=${AUTHD_TESTS_CLI_AUTHENTICATE_TESTS_SOCK} force_native_client=true
Username: user-local-groups
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker: 2
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker: goodpass
Provided input can't be parsed as integer value
== Broker selection (use 'r' to go back) ==
1 - local
2 - ExampleBroker
Select broker:

















────────────────────────────────────────────────────────────────────────────────
